
//=============================================================================
//	@file	BackGround.cpp
//	@brief	背景
//	@autor	Takuya Ochi
//	@date	2018/12/22
//=============================================================================

//-----------------------------------------------------------------------------
//	@brief	インクルード
//-----------------------------------------------------------------------------
#include "BackGround.h"
#include "Common.h"
#include "MoveHelper.h"

//-----------------------------------------------------------------------------
//	@brief	静的定数
//-----------------------------------------------------------------------------
const float BackGround::SKYDOME_MOVE_SPEED = 0.0005f;			//	スカイドームの移動速度

//-----------------------------------------------------------------------------
//	@brief	コンストラクタ
//-----------------------------------------------------------------------------
BackGround::BackGround()
{
	//	処理なし
}

//-----------------------------------------------------------------------------
//	@brief	デストラクタ
//-----------------------------------------------------------------------------
BackGround::~BackGround()
{
	//	最終的な解放
	_FinalRelease();
}

//-----------------------------------------------------------------------------
//	@brief	作成
//-----------------------------------------------------------------------------
void BackGround::Create()
{
	m_productionTime = 0.0f;

    //	モデルの読み込み
    m_modelHandle = MV1LoadModel("Data/Model/BackGround/Skydome.pmx");
    CommonDebug::Assert((m_modelHandle <= -1), " [ BackGround.cpp ] : error : model loading failed.");

    //	各変数の初期化
    m_pos = CommonConstant::ORIGIN;
    m_dir = CommonConstant::ORIGIN;
    m_angle = CommonConstant::ORIGIN;
    m_size = VGet(1.0f, 1.0f, 1.0f);
}

//-----------------------------------------------------------------------------
//	@brief	解放
//-----------------------------------------------------------------------------
void BackGround::Release()
{
	MV1DeleteModel(m_modelHandle);
}


//-----------------------------------------------------------------------------
//	@brief	更新処理
//-----------------------------------------------------------------------------
void BackGround::Update()
{
	//	必殺技のときは更新しない
	const bool isNotSpecialProduction = !PRODUCTION->GetIsSpecialProduction();
	if (isNotSpecialProduction)
	{
		//	スカイドーム横回転
		m_angle.y -= SKYDOME_MOVE_SPEED;

		//	スカイドーム
		MV1SetPosition(m_modelHandle, m_pos);
		MV1SetRotationXYZ(m_modelHandle, m_angle);
	}
}

//-----------------------------------------------------------------------------
//	@brief	描画
//-----------------------------------------------------------------------------
void BackGround::Draw()
{
	//	描画
	MV1DrawModel(m_modelHandle);
}

//-----------------------------------------------------------------------------
//	@brief	最終的な解放
//-----------------------------------------------------------------------------
void BackGround::_FinalRelease()
{
	MV1DeleteModel(m_modelHandle);
}
