
//=============================================================================
//	@file	BackGround.h
//	@brief	背景
//	@autor	Takuya Ochi
//	@date	2018/12/22
//=============================================================================

//-----------------------------------------------------------------------------
//	@brief	プリプロセッサ
//-----------------------------------------------------------------------------
#pragma once

//-----------------------------------------------------------------------------
//	@brief	インクルード
//-----------------------------------------------------------------------------
#include "DxLib.h"
#include "Common.h"

//-----------------------------------------------------------------------------
//	@brief	背景クラス
//-----------------------------------------------------------------------------
class BackGround final
{
public:

//===================== 関数 ======================//

	//	コンストラクタ/デストラクタ
	BackGround();
	~BackGround();

	//	作成処理
	void Create();

	//	解放処理
	void Release();

	//	更新処理
	void Update();

	//	描画処理
	void Draw();

private:

//================== 内部処理関数 ==================//

	//	最終的な解放処理
	void _FinalRelease();

//=================== メンバ変数 ===================//

	float			m_productionTime;	//	演出時間
    int			    m_modelHandle;		//	モデルハンドル
    VECTOR		    m_pos;				//	ポジション
    VECTOR		    m_dir;				//	ディレクション
    VECTOR		    m_angle;			//	アングル
    VECTOR		    m_size;				//	サイズ
    float		    m_speed;			//	速度

//===================== 静的定数 ===================//

	static const float SKYDOME_MOVE_SPEED;			//	スカイドームの移動速度
};