
//=============================================================================
//	@file	Fade.h
//	@brief	フェード
//	@autor	Takuya Ochi
//	@date	2018/9/28
//=============================================================================

//-----------------------------------------------------------------------------
//	@brief	プリプロセッサ
//-----------------------------------------------------------------------------
#pragma once

//-----------------------------------------------------------------------------
//	@brief	インクルード
//-----------------------------------------------------------------------------
#include "DxLib.h"

//-----------------------------------------------------------------------------
//	@brief	フェードクラス
//-----------------------------------------------------------------------------
class Fade final
{
public:

//===================== 関数 ======================//

	//	デストラクタ
	~Fade();

	//	インスタンスの作成
	static void CreateInstance();

	//	インスタンスの削除
	static void DeleteInstance();

	//	インスタンスの取得
	static Fade* GetInstance();

	//	更新処理
	void Update();

	//	フェード開始
	void IsFadeStart();

private:

//================== シングルトン ==================//

	//	コンストラクタ
	Fade();

//================== 内部処理関数 ==================//

	//	フェードイン
	void _FadeIn();

	//	フェードアウト
	void _FadeOut();

	//	描画
	void _Draw();

//=================== メンバ変数 ===================//

	static Fade*	s_instance;			//	インスタンス
	int				m_alpha;			//	不透明度
	bool			m_isOneTime;		//	開始時のみ
	bool			m_isFadeIn;			//	フェードイン
	bool			m_isFadeOut;		//	フェードアウト
	bool			m_isEndFade;		//	エンドフェード
};

#define FADE Fade::GetInstance()		//	フェードのインスタンス