
//=============================================================================
//	@file	HandOverToResult.h
//	@brief	リザルトへ引き渡し
//	@autor	Takuya Ochi
//	@date	2018/1/03
//=============================================================================

//-----------------------------------------------------------------------------
//	@brief	インクルード
//-----------------------------------------------------------------------------
#include "HandOverToResult.h"

//-----------------------------------------------------------------------------
//	@brief	静的メンバ変数の実態の作成
//-----------------------------------------------------------------------------
HandOverToResult	*HandOverToResult::s_instance = nullptr;

//-----------------------------------------------------------------------------
//	@brief	コンストラクタ
//-----------------------------------------------------------------------------
HandOverToResult::HandOverToResult()
{
	m_life = 0;
	m_destructionNum = 0;
	m_isClear = false;
}

//-----------------------------------------------------------------------------
//	@brief	デストラクタ
//-----------------------------------------------------------------------------
HandOverToResult::~HandOverToResult()
{
	//	処理なし
}

//-----------------------------------------------------------------------------
//	@brief	インスタンス生成
//-----------------------------------------------------------------------------
void HandOverToResult::CreateInstance()
{
	//	すでに存在している
	if (s_instance) { CommonDebug::Log(" [ HandOverToResult.cpp ] : error : Instance has been created."); return; }

	//	nullptrのとき
	if (!s_instance) { HandOverToResult::s_instance = new HandOverToResult(); }

	//	作成失敗
	if (!s_instance) { CommonDebug::Log(" [ HandOverToResult.cpp ] : error : Failed to create instance."); return; }
}

//-----------------------------------------------------------------------------
//	@brief	インスタンス削除
//-----------------------------------------------------------------------------
void HandOverToResult::DeleteInstance()
{
	CommonSafe::Delete(s_instance);
}

//-----------------------------------------------------------------------------
//	@brief	インスタンス生成
//-----------------------------------------------------------------------------
HandOverToResult* HandOverToResult::GetInstance()
{
	return s_instance;
}

//-----------------------------------------------------------------------------
//	@brief	リセット
//-----------------------------------------------------------------------------
void HandOverToResult::Reset()
{
	m_life = 0;
	m_destructionNum = 0;
	m_isClear = false;
}
