
//=============================================================================
//	@file	LoadScene.h
//	@brief	ローディング
//	@autor	Takuya Ochi
//	@date	2018/12/30
//=============================================================================

//-----------------------------------------------------------------------------
//	@brief	プロプロセッサ
//-----------------------------------------------------------------------------
#pragma once

//-----------------------------------------------------------------------------
//	@brief	インクルード
//-----------------------------------------------------------------------------
#include "DxLib.h"
#include "Common.h"

//-----------------------------------------------------------------------------
//	@brief	ローディングクラス
//-----------------------------------------------------------------------------
class Loading final
{
public:

//===================== 関数 ======================//

	//	デストラクタ
	~Loading();

	//	インスタンスの作成
	static void CreateInstance();

	//	インスタンスの削除
	static void DeleteInstance();

	//	インスタンスの取得
	static Loading* GetInstance();

	//	描画
	void Draw();

private:

//================== シングルトン ==================//

	//	コンストラクタ
	Loading();

//=================== メンバ変数 ===================//

	static Loading*		s_instance;			//	インスタンス
	int					m_spriteHendle;		//	スプライトハンドル

};

#define LOADING Loading::GetInstance()