
//=============================================================================
//	@file	Player.cpp
//	@brief	プレイヤー
//	@autor	Takuya Ochi
//	@date	2018/11/14
//=============================================================================

//-----------------------------------------------------------------------------
//	@brief	プリプロセッサ
//-----------------------------------------------------------------------------
#pragma once

//-----------------------------------------------------------------------------
//	@brief	インクルード
//-----------------------------------------------------------------------------
#include "DxLib.h"
#include "PlayerBase.h"

//-----------------------------------------------------------------------------
//	@brief	前方宣言
//-----------------------------------------------------------------------------
class Pad;
class ShotManager;
class StayShotManager;
class SoundEffect;
class UIGauge;

//-----------------------------------------------------------------------------
//	@brief	プレイヤークラス
//-----------------------------------------------------------------------------
class TitlePlayer : public PlayerBase
{
public:

//===================== 関数 ======================//

    //	コンストラクタ / デストラクタ
    TitlePlayer(const int _modelHandle);
    ~TitlePlayer();

    //	作成処理
    void Create() override final;

    //	解放処理
    void Release() override final;

    //	初期処理
    void Initialize() override final;

    //	更新処理
    void Update() override final;

private:

//================== 内部処理関数 ==================//

    //  開始時の演出
    void _StartProdoction();

    //  浮遊演出
    void _FloatingProdoction();

    //	最終的な解放処理
    void _FinalRelease() override final;
};